import React from 'react';
import { Container, Row, Col } from 'react-bootstrap';

const PrivacyPolicy = () => {

  return (
    <main>
      <Container className="py-5">
        <Row className="align-items-center" >
            <Col md={10}>
                <br/>
                <h2>
                    Политика конфиденциальности
                </h2>
                <br/>
                <p>
                    Действующая редакция от 17 июля 2018 г.
                </p>
                <br/>
                <p>
                    Настоящая Политика конфиденциальности определяет, какие данные о Вас и какими способами ООО «Русская рыбалка СПб» 
                    собирает и обрабатывает в ходе использования Вами компьютерной игры «Русская рыбалка 4»/«Russian Fishing 4» 
                    (в дальнейшем «Игра»), официального сайта Игры https://rf4game.ru/ («Сайт»), форума Игры https://rf4game.ru/forum/ 
                    («Форум»), а также служб поддержки игроков.
                </p>
                <p>
                    Просим Вас внимательно прочитать настоящую Политику конфиденциальности до начала использования Игры, Сайта или Форума. 
                    Продолжая использовать Игру, Сайт или Форум, Вы полностью соглашаетесь с настоящей Политикой конфиденциальности.
                </p>
                <br/>
                <p>
                    1. Контролер пользовательских данных.
                </p>
                <br/>
                <p>
                    Контролёром пользовательских данных является ООО «Русская рыбалка СПб», которое определяет цели и способы обработки 
                    Ваших пользовательских данных, находящееся по адресу 197101, Санкт-Петербург, ул.Большая Монетная, д.16, корпус 30,лит.А, пом.13-Н.
                </p>
                <br/>
                <p>
                    2. Данные о Вас, которые мы собираем.
                </p>
                <br/>
                <p>
                    2.1. При создании игрового аккаунта — логин (имя в игре) и адрес электронной почты.
                </p>
                <br/>
                <p>
                    2.2. При Вашем обращении в службу поддержки, отправлении Вами сообщений/комментариев в игровых чатах, форуме и 
                    сайте – данные, которые Вы направляете по своему усмотрению и/или с Вашего согласия.
                </p>
                <br/>
                <p>
                    2.3. IP-адрес Вашего устройства.
                </p>
                <br/>
                <p>
                    2.4. Генерируемый нами ID каждого игрока (номер аккаунта).
                </p>
                <br/>
                <p>
                    2.5. Технические характеристики и данные о устройстве (операционная система, производитель, модель, разрешение 
                    экрана, язык интерфейса).
                </p>
                <br/>
                <p>
                    2.6. Данные о всех Ваших действиях в Игре и взаимодействии с другими игроками.
                </p>
                <br/>
                <p>
                    2.7. Общедоступные данные, такие как Ваши отзывы, комментарии, мнения об Игре и наших услугах, опубликованные Вами в виде 
                    текстов, аудиозаписей, видеозаписей на общедоступных ресурсах.
                </p>
                <br/>
                <p>
                    3. Данные о Вас, которые мы не собираем:
                </p>
                <br/>
                <p>
                    3.1. Мы не запрашиваем у Вас данные о ФИО.
                </p>
                <br/>
                <p>
                    3.2. Мы не обрабатываем никакие данные о Ваших платежных инструментах (в частности, данные электронных кошельков, банковских 
                    карт и т.п.).
                </p>
                <br/>
                <p>
                    3.3. Мы не запрашиваем и не собираем о Вас какие бы то ни было другие личные данные (например, данные о Вашем здоровье, расе, 
                    религии, политических взглядах и т.п.). Мы призываем Вас с осторожностью распространять такие сведения о себе в игровых чатах и на форуме Игры.
                </p>
                <br/>
                <p>
                    4. Цели обработки Ваших данных.
                </p>
                <br/>
                <div>
                    <p>
                        Мы используем данные, собранные о Вас и Вашем устройстве, для предоставления Вам услуг в рамках Лицензионного Договора.
                    </p>
                    <p>
                        Цели и задачи, которыми мы руководствуемся при обработке Ваших данных, включают в себя:
                    </p>
                    <p>
                        — администрирование и поддержка Игры, Сайта и Форума;
                    </p>
                    <p>
                        — создание аккаунтов игроков, формирование и поддержка базы данных игроков;
                    </p>
                    <p>
                        — получение сообщений об ошибках в работе Игры, повышение качества технической поддержки, разработка, доработка, улучшение 
                        Игры, Сайта и Форума;
                    </p>
                    <p>
                        — предоставление Вам возможности общаться с другими игрокам в игровых чатах и на Форуме;
                    </p>
                    <p>
                        — направление Вам, в случае Вашего согласия, по электронной почте сообщений информационного характера о существенных обновлениях в Игре, 
                        специальных акциях, скидках и т.п.;
                    </p>
                    <p>
                        — борьба с недостойным поведением и с нечестными методами игры. Для этого мы вправе отслеживать и анализировать сообщения игроков в чате Игре 
                        и на Форуме, принимать меры в отношении игроков, нарушающих Лицензионный договор, Правила поведения на серверах Игры и Правила поведения на Форуме Игры;
                    </p>
                    <p>
                        — соблюдение применимых законов, исполнение юридических обязанностей, реализация или защита наших прав, защита Ваших интересов или интересов других лиц.
                    </p>
                </div>
                <br/>
                <p>
                    5. Общедоступные данные.
                </p>
                <br/>
                <p>
                    Некоторые Ваши данные могут быть доступны для просмотра другими лицами. Например, другие игроки могут видеть Ваш логин и аватар(изображение), 
                    Ваши игровые результаты, сообщения в чатах и на Форуме. Кроме того, Ваш игровой логин и аватар профиля могут быть доступны в различных 
                    рейтингах игроков и таблицах рекордов.
                </p>
                <br/>
                <p>
                    6. Передача Ваших данных третьим лицам.
                </p>
                <br/>
                <p>
                    Мы никому не разглашаем Ваши данные и обеспечиваем их конфиденциальность. Однако, в случае законного запроса правоохранительных или других 
                    уполномоченных государственных органов, мы вправе предоставить любые Ваши данные, имеющиеся у нас.
                </p>
                <br/>
                <p>
                    7. Ваши права.
                </p>
                <br/>
                <div>
                    <p>
                        7.1. Вы вправе с разумной периодичностью запрашивать у нас информацию о Ваших персональных данных. Для этого Вам следует направить запрос 
                        в нашу службу поддержки support@rf4game.ru c электронной почты, указанной Вами при регистрации аккаунта, и следовать предоставленным инструкциям.
                    </p>
                    <p>
                        В некоторых случаях для выполнения запроса мы вправе запросить у Вас дополнительные сведения, необходимые для идентификации Вас в качестве нашего 
                        пользователя. Мы обязуемся бесплатно выполнить Ваш запрос в срок, не превышающий 30 дней с момента получения от Вас запроса.
                    </p>
                    <p>
                        Мы вправе отказать Вам в реализации этого права или запросить выплату вознаграждения, в случае, если Ваш запрос не имеет разумного обоснования, 
                        или в случае, если Вы направляете нам подобные запросы чаще, чем 1 раз за 90 дней.
                    </p>
                </div>
                <br/>
                <div>
                    <p>
                        7.2. Вы вправе в любой момент запросить уточнение неточных персональных данных. Если какие-либо Ваши персональные данные, обрабатываемые нами, 
                        стали для Вас неактуальными, сообщите об этом в нашу службу поддержки support@rf4game.ru c электронной почты, указанной Вами при регистрации аккаунта.
                    </p>
                    <p>
                        В некоторых случаях для выполнения запроса мы вправе запросить у Вас дополнительные сведения, необходимые для идентификации Вас в качестве нашего пользователя. 
                        Мы обязуемся бесплатно выполнить Ваш запрос в срок, не превышающий 30 дней с момента получения от Вас запроса.
                    </p>
                    <p>
                        Мы вправе отказать Вам в реализации этого права или запросить выплату вознаграждения, в случае, если Ваш запрос не имеет разумного обоснования, или в случае, 
                        если Вы направляете нам подобные запросы чаще, чем 1 раз за 90 дней.
                    </p>
                </div>
                <br/>
                <div>
                    <p>
                        7.3. Вы вправе запросить удаление Вашего аккаунта, направив нам соответствующее уведомление в службу поддержки support@rf4game.ru c электронной 
                        почты, указанной Вами при регистрации аккаунта.
                    </p>
                    <p>
                        В некоторых случаях для выполнения запроса мы вправе запросить у Вас дополнительные сведения, необходимые для идентификации Вас в качестве нашего 
                        пользователя. Мы обязуемся бесплатно выполнить Ваш запрос в срок, не превышающий 30 дней с момента получения от Вас запроса.
                    </p>
                    <p>
                        Обратите внимание, что при удалении Вашего аккаунта будет безвозвратно утерян весь игровой опыт персонажа, все достижения и результаты, а также 
                        виртуальное игровое имущество.
                    </p>
                    <p>
                        Мы вправе продолжать хранить некоторые Ваши данные даже после выполнения Вашего запроса об удалении аккаунта, если мы обязаны делать это для выполнения 
                        требований применимого законодательства, или если Ваши данные были анонимизированы, и тем самым больше не являются вашими персональными данными.
                    </p>
                </div>
                <br/>
                <p>
                    8. Сроки обработки Ваших данных.
                </p>
                <br/>
                <p>
                    Ваши данные хранятся и обрабатываются столько, сколько это необходимо для предоставления Вам доступа к Игре и Форуму.
                </p>
                <br/>
                <p>
                    9. Файлы cookie.
                </p>
                <br/>
                <div>
                    <p>
                        На нашем Сайте мы используем файлы cookie. При этом речь идет о небольших файлах, которые автоматически создает ваш браузер, и которые сохраняются 
                        на вашем устройстве (ноутбуке, планшете, смартфоне и т.п.), когда вы заходите на наш Сайт. Файлы cookie никак не вредят работе Вашего устройства 
                        и не содержат никаких вирусов, «троянов» и прочих вредоносных программных средств.
                    </p>
                    <p>
                        Использование файлов cookie служит для Вашего удобства. При повторном посещении нашего Сайта и пользовании нашими службами происходит 
                        автоматическое распознавание, что Вы у нас уже были, какие данные Вы вводили, и какие настройки Вы осуществляли, и Вам не нужно будет делать это еще раз.
                    </p>
                    <p>
                        Также мы используем файлы cookie для сбора статистических данных по пользованию нашим Сайтом в целях оптимизации работы Сайта.
                    </p>
                    <p>
                        По истечении определенного времени эти файлы автоматически удаляются.
                    </p>
                    <p>
                        Большинство браузеров принимают файлы cookie автоматически. Вы можете отключить файлы cookie в Вашем браузере. Однако, полное отключение 
                        файлов cookie может привести к тому, что Вы не сможете пользоваться всеми функциями нашего Сайта.
                    </p>
                </div>
                <br/>
                <p>
                    10. Безопасность данных.
                </p>
                <div>
                    <p>
                        Во время посещения нашего Сайта мы используем протокол TLS (протокол защиты транспортного уровня, англ. Transport Layer Security) 
                        в сочетании с максимально возможной степенью шифрования, поддерживаемой вашим браузером. Как правило, речь идет о 256-битном шифровании. 
                        Если ваш браузер не поддерживает 256-битное шифрование, мы используем 128-битное шифрование. Зашифрованную передачу отдельной станицы 
                        нашего Сайта можно распознать по символу закрытого замка в нижней статусной строке вашего браузера.
                    </p>
                    <p>
                        Помимо этого, мы используем подходящие технические и организационные меры безопасности, чтобы защитить ваши данные от случайных 
                        или преднамеренных манипуляций, от их частичной или полной потери, разрушения или от несанкционированного доступа к ним третьих лиц. 
                        Наши меры безопасности постоянно совершенствуются в соответствии с технологическим прогрессом.
                    </p>
                </div>
                <p>
                    11. Актуальность и изменение настоящей Политики конфиденциальности.
                </p>
                <div>
                    <p>
                       Настоящая Политика конфиденциальности является актуальной, последнее обновление было выполнено в июле 2018 г.
                    </p>
                    <p>
                        В результате совершенствования нашего Сайта и наших предложений или изменения законодательных или административных 
                        предписаний может потребоваться изменение настоящей Политики конфиденциальности. Актуальную версию Политики 
                        конфиденциальности можно всегда найти и распечатать с нашего Сайта https://rf4game.ru/privacy/.
                    </p>
                </div>
          </Col>
        </Row>
      </Container>
    </main>
  );
};

export default PrivacyPolicy;
