import React from 'react';
import { Container, Row, Col } from 'react-bootstrap';

const Rules = () => {

  return (
    <main>
      <Container className="py-5">
        <Row className="align-items-center">
            <Col md={10}>
                <br/>
                <h2>
                    Правила поведения на серверах ООО «Русская Рыбалка СПб» 
                    <p>
                        Внимание!
                    </p>
                </h2>
                <br/>
                <p>
                    Регистрации в качестве игрока означает, что Вы полностью соглашаетесь с настоящими Правилами, которые не отменяют, 
                    а дополняют Лицензионный договор с конечным пользователем и Правила поведения на форуме онлайновой интерактивной игры 
                    «Русская Рыбалка 4». При игре на игровых серверах ООО «Русская Рыбалка СПб» запрещено:
                </p>
                <br/>
                <p>
                    1. Использовать ненормативную лексику на всех языках (как прямую, так и завуалированную). Модератор принимает решение 
                    о правомерности использования лексики, исходя из контекста разговора. Наказание – бан от 1 до 30 дней на усмотрение модератора он-лайн.
                </p>
                <p>
                    2. Употреблять нецензурные или оскорбительные выражения в адрес других пользователей серверов ООО «Русская Рыбалка СПб», а также 
                    участников Проекта. Наказание – бан от 3 до 30 дней на усмотрение модератора он-лайн.
                </p>
                <br/>
                <p>
                    3. Оскорблять достоинство людей по расовым, национальным, религиозным и иным признакам. Наказание – бан от 7 до 30 дней на усмотрение модератора он-лайн.
                </p>
                <br/>
                <p>
                    4. Вводить большое (более 3 (трех) подряд или часто) количество одинаковых или однотипных наборов букв, слов или сообщений. Злоупотреблять при написании 
                    сообщений заглавными буквами. Запрещается публикация спама, использование неинформативных знаков, а также флуд. Наказание – бан от 1 до 30 дней на усмотрение 
                    модератора он-лайн.
                </p>
                <br/>
                <p>
                    5. Производить любые действия, нарушающие работоспособность серверов он-лайн, препятствующие общению игроков между собой, а также сознательное создание 
                    помех игре, проводимым турнирам. Наказание – бан от 2 до 30 дней на усмотрение модератора он-лайн.
                </p>
                <br/>
                <p>
                    6. Обсуждение действий/бездействия модераторов и/или администраторов. Наказание – бан от 3 до 30 дней на усмотрение модератора он-лайн.
                </p>
                <br/>
                <p>
                    6.1. Размещать ложную, клеветническую, оскорбительную и иную противоправную информацию (в том числе разглашение персональных данных) в отношении модераторов, 
                    администраторов, разработчиков и других участников проекта «Русская Рыбалка 4». Наказание – бан 30 дней.
                </p>
                <br/>
                <p>
                    7. Пропагандировать насилие, наркотики, порнографию, а также призывать к совершению деяний нарушающих законы Российской Федерации и других стран. Наказание – 
                    бан от 5 до блокирования аккаунта на усмотрение Администрации.
                </p>
                <br/>
                <p>
                    8. Обсуждать методы взлома компьютерных программ, нечестного поведения в игре. Наказание – бан от 5 до 30 дней на усмотрение модератора он-лайн.
                </p>
                <br/>
                <p>
                    9. Публиковать рекламные и коммерческие сообщения, в том числе и интернет-ссылки на ресурсы, без предварительного согласования с администрацией 
                    проекта. Наказание – бан от 1 до 30 дней на усмотрение модератора он-лайн.
                </p>
                <br/>
                <p>
                    10. Использовать любые методы или сторонние программы с целью подделки результатов в игре. Наказание – пожизненный бан, блокирование аккаунта.
                </p>
                <br/>
                <p>
                    11. Нарушать условия Лицензионного договора на право использования программы для ЭВМ «Русская Рыбалка 4». Наказание – пожизненный бан, блокирование аккаунта.
                </p>
                <br/>
                <p>
                    12. Вести на игровом сервере деятельность, способствующую разжиганию скандала. Запрещен троллинг, т.е. размещение грубой, оскорбительной, провокационной 
                    информации. Наказание – бан от 3 до 30 дней на усмотрение модератора он-лайн
                </p>
                <br/>
                <p>
                    13. Запрещено использовать ники (или варианты ников), пропагандирующие наркотики, фашизм, расизм, нацизм, ники эротического, порнографического и нацистского 
                    характера, выражающие жестокость и насилие, содержащие нецензурные или грубые (непристойные) выражения, а так же ники, название которых связано 
                    с любыми служебными должностями в ООО «Русская Рыбалка СПб» и дублирующими названия турниров (как в русской, так и в английской раскладке). 
                    Запрещено использование в нике ссылок на любые веб-ресурсы. Наказание – пожизненный бан, блокирование аккаунта.
                </p>
                <br/>
                <p>
                    13.1. Запрещены аватары выражающие жестокость и насилие, содержащие нецензурные или грубые выражения, эротические и порнографические изображения. 
                    Наказание – бан 3 дня с продлением бана до удаления аватара.
                </p>
                <br/>
                <p>
                    14. Запрещены любые объявления (сообщения) о купле-продаже чего-либо за «реальные» деньги, т.е. рубли или другую действующую 
                    денежную единицу или валюту, а также объявления о продаже или передаче игрового профиля. Наказание – бан на 3 месяца или полное 
                    блокирование аккаунта по решению администрации проекта
                </p>
                <br/>
                <p>
                    15.1. Использование багов (недочетов) игры в целях личного обогащения или упрощения игрового процесса для использующего баг, 
                    наказывается блокировкой аккаунта сроком от 3-х месяцев или удалением аккаунта, на усмотрение Администрации.
                </p>
                <br/>
                <p>
                    15.2. Использование в процессе игры любых сторонних программ, позволяющих вмешиваться в игровой процесс. Наказание – удаление аккаунта.
                </p>
                <br/>
                <p>
                    16. Предоставление заведомо ложной информации для проверки игровых логов истории покупокаукционаобмена наказывается удалением игрового аккаунта.
                </p>
                <br/>
                <div>
                    <p>
                        17. Сознательный обман одним игроком другого, с целью извлечения материальной или какой-либо другой выгоды, 
                        наказывается баном на 30 дней. В случае повторения — блокирование аккаунта.
                    </p>
                    <p>
                        Неоднократное нарушение правил
                    </p>
                </div>
                <br/>
                <p>
                    За неоднократное нарушение правил, по всем пунктам срок бана может быть увеличен главным модератором онлайна.
                </p>
                <br/>
                <p>
                    В случае нарушения нескольких пунктов правил срок бана суммируется.
                </p>
                <br/>
                <div>
                    <p>
                        Примечание:
                    </p>
                    <p>
                        Незнание указанных Правил не освобождает от ответственности за их нарушение.
                    </p>
                    <p>
                        Используемые термины:
                    </p>
                    <p>
                        Бан – штрафная санкция за нарушение Пользователем условий лицензионного 
                        соглашения и приложений к нему, состоящая в ограничении доступа к он-лайн игре «Русская Рыбалка 4».
                    </p>
                    <p>
                        Ник, никнейм — вымышленное имя, которым Пользователь называет себя, регистрируясь в он-лайн игре.
                    </p>
                    <p>
                        Спам – часто повторяющееся и/или назойливые сообщения.
                    </p>
                    <p>
                        Флуд — размещение бессмысленных сообщений или однотипной информации (слов, символов, ссылок, графических файлов и т.д.).
                    </p>
                </div>
                <br/>
                <p>
                    На усмотрение модератора бан может быть заменен количеством килограммов рыбы, который персонаж игрока должен выловить 
                    на штрафном пруду для получения полного доступа к игровому процессу.
                </p>
                <br/>
                <p>
                    Если Вы уверены, что против Вас модераторами применены безосновательные действия, Вы можете подать соответствующую 
                    претензию, написав нам письмо.
                </p>
                <br/>
                <div>
                    <p>
                        Обязательно указать:
                    </p>
                    <p>
                        Ваш ник и номер аккаунта в игре, которому был закрыт доступ в игре «Русская Рыбалка 4».
                    </p>
                    <p>
                        Дату и время закрытия Вам доступа.
                    </p>
                    <p>
                        Ваш контактный e-mail. По возможности, другие средства связи.
                    </p>
                    <p>
                        Обязательно указать в теме сообщения текст: «претензия аккаунт».
                    </p>
                    <p>
                        Подача претензии
                    </p>
                </div>
                <br/>
                <p>
                    Претензии принимаются в течение 7 (семи) дней с момента инцидента на email-адрес admin@rf4game.ru
                </p>
                <br/>
                <p>
                    Ответ по претензии Вы получите в течение 3 (трех) дней, но только при верном заполнении 
                    вышеперечисленных пунктов (в противном случае, на письма с претензиями ответы и объяснения не отсылаются).
                </p>
                <br/>
                <p>
                    В случае обнаружения неправомерных действий модератора, виновный будет наказан вплоть до снятия модераторских прав.
                </p>
                <br/>
                <p>
                    В случае установления злоупотребления правом на обжалование действий модератора, к игроку может быть 
                    применен пожизненный бан с удалением учетной записи.
                </p>
                <br/>
          </Col>
        </Row>
      </Container>
    </main>
  );
};

export default Rules;
